//! ВЕРНУТЬ ЧИСЛО ИЗ СТРОКИ
el.textContent.parseInt("   12", 10); //* Принимает аргументом строку и основание системы счисления в диапазоне от 2 до 36. // 12
//! МАТЕМАТИЧЕСКИЕ ФУНКЦИИ
Math.abs(x) //*: возвращает абсолютное значение числа x.
Math.abs(-5); // Возвращает 5
Math.round(x)//*: округляет число x до ближайшего целого числа.
Math.round(2.4); // Возвращает 2
Math.ceil(x) //*: округляет число x до ближайшего большего целого числа.
Math.ceil(2.4); // Возвращает 3
Math.floor(x) //*: округляет число x до ближайшего меньшего целого числа.
Math.floor(2.9); // Возвращает 2
Math.max(x, y, а) //* : возвращает наибольшее число из переданных аргументов.
Math.max(1, 2, 3); // Возвращает 3
Math.min(x, y, а) //*: возвращает наименьшее число из переданных аргументов.
Math.min(1, 2, 3); // Возвращает 1
Math.pow(x, y) //*: возводит число x в степень y.
Math.pow(2, 3); // Возвращает 8
Math.random() //*: возвращает случайное число от 0 до 1.
Math.random(); // Возвращает случайное число от 0 до 1
Math.sqrt(x) //*: вычисляет квадратный корень числа x.
Math.sqrt(25); // Возвращает 5
Math.sin(x) //*: вычисляет синус угла x.
Math.sin(Math.PI / 2); // Возвращает 1
Math.tan(x) //*: вычисляет тангенс угла x.
Math.tan(Math.PI / 4); // Возвращает 1
