package main
import "fmt"

func main() {
    var hello string
    hello = "Hello world"
    fmt.Println(hello)
    // ⁡⁢⁣⁢GO (ЧАСТО НАЗЫВАЕМЫЙ GOLANG)⁡ ⁡⁣⁣⁢— это компилируемый, статически типизированный язык программирования, разработанный внутри компании 𝘎𝘰𝘰𝘨𝘭𝘦. Он был создан для решения проблем, связанных с написанием высоконагруженных, масштабируемых и надежных программных систем, которые стали особенно актуальными с распространением многоядерных процессоров и облачных технологий⁡⁣⁣⁢. Go — это прагматичный язык для создания надежного и производительного программного обеспечения в эпоху многоядерных процессоров и облачных вычислений. Он не стремится быть универсальным решением для всех задач, но в своей нише — бэкенд, облачные и сетевые сервисы — он является одним из самых сильных и востребованных инструментов, что подтверждается его выбором ведущими мировыми технологическими компаниями⁡
}
